---
kind: method
id: M:Autodesk.Revit.DB.BRepBuilderGeometryId.Dispose
source: html/91431a10-f30f-6e2c-ddad-0b9403f6a6c7.htm
---
# Autodesk.Revit.DB.BRepBuilderGeometryId.Dispose Method

Releases all resources used by the BRepBuilderGeometryId

## Syntax (C#)
```csharp
public void Dispose()
```